:PROPERTIES:
:ID:       13d1007d-c805-482c-bf95-5e53ba86bf4c
:END:
#+title: doom emacs
#+FILETAGS: emacs

**** 列表
- 特点：对列表求值时。默认第一个元素解释为操作符，其他元素被视为参数。
#+begin_src elisp :results output
(setq my-list '(1 2 3))
(print my-list)
(setq my-list (1 2 3)) #错误：(1 2 3)被当作表达式求值，1被当作操作符，2和3被当作操作数
#+end_src

#+RESULTS:
: (1 2 3)
** 引用：quote(')
- 作用：防止表达式被求值，原样返回。
- 使用场景：用于表达数据，而不是执行这段代码。
#+begin_src elisp :results output
(setq x (list 1 2 3 4 5)) #计算了(list 1 2 3 4 5)
(print x)
(setq x '(list 1 2 3 4 5)) #没有计算(list 1 2 3 4 5)
(print x)
(setq x '(1 2 3 4 5))
(print x)
#+end_src

#+RESULTS:
: (1 2 3 4 5)
: (list 1 2 3 4 5)
: (1 2 3 4 5)
